data/Parm_PH_29/alpha_05/alpha_05_4071_2024/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15600
(
(0.0210701554105854 1.00078212633556 1.07067863596906e-17)
(0.063161363621181 0.999497980015715 -2.87398057920139e-18)
(0.104448046885031 0.992484930751124 5.44445756032536e-18)
(0.142747600656233 0.975901721312757 -6.10325508156258e-18)
(0.176065731762271 0.95053108519337 -3.63779915313327e-18)
(0.204737721871649 0.919761628649183 1.92637237281944e-18)
(0.230373157080397 0.88636783052221 -1.7469372721649e-18)
(0.254127022731276 0.851603529924206 1.8726661975707e-18)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0210782029096729 1 0)
(0.0631672268864217 0.998714446529939 0)
(0.104406063859644 0.991709236848229 0)
(0.142645191041785 0.97516045166527 0)
(0.175919729239806 0.949832161195367 0)
(0.204572548443908 0.91906376767944 0)
(0.230198349223924 0.885632683219264 0)
(0.253944452591259 0.850807121933699 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0169625 2.024 0)
(0.0508875 2.024 0)
(0.0848125 2.024 0)
(0.1187375 2.024 0)
(0.1526625 2.024 0)
(0.1865875 2.024 0)
(0.2205125 2.024 0)
(0.2544375 2.024 0)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
