data/Parm_PH_29/alpha_05/alpha_05_4071_2024/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
15600
(
1.00078212633556
0.999497980015715
0.992484930751124
0.975901721312757
0.95053108519337
0.919761628649183
0.88636783052221
0.851603529924206
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
1
0.998714446529939
0.991709236848229
0.97516045166527
0.949832161195367
0.91906376767944
0.885632683219264
0.850807121933699
...
)
;
    }
    topWall
    {
        type            calculated;
        value           uniform 2.024;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
