data/Parm_PH_29/alpha_05/alpha_05_4071_2024/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
15600
(
1.07067863596906e-17
-2.87398057920139e-18
5.44445756032536e-18
-6.10325508156258e-18
-3.63779915313327e-18
1.92637237281944e-18
-1.7469372721649e-18
1.8726661975707e-18
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           uniform 0;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
