data/Parm_PH_29/alpha_05/alpha_05_4071_2024/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.02762033 -0.00054453 0.00000000 0.00019435 0.00000000 0.01366125)
(0.02402331 -0.00017448 0.00000000 -0.00004085 0.00000000 0.01065070)
(-0.00065651 -0.00064002 0.00000000 0.00067491 0.00000000 0.00401412)
(0.00072777 -0.00074119 0.00000000 0.00071857 0.00000000 0.00240017)
(-0.00016901 -0.00019828 0.00000000 0.00045060 0.00000000 0.00147069)
(0.00021168 -0.00014316 0.00000000 0.00002365 0.00000000 0.00041272)
(-0.00000597 -0.00011627 0.00000000 0.00040608 0.00000000 0.00150701)
(0.00008124 -0.00006112 0.00000000 0.00001592 0.00000000 0.00054027)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
