data/Parm_PH_29/alpha_05/alpha_05_4071_2024/system/singleGraph_x6
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/

start   (6 0 0);
end     (6 3.035 0);
// Fields not available in a given solver will be ignored
fields  (U p k omega Pk PkBoussinesq PkDelta PkLES kDeficit U_LES k_LES);

// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

// Override settings here, e.g.
setConfig
{
  type lineCell;   //lineUniform, lineCell, lineCellFace
  axis xyz;  // x, y, z, xyz
}


// Must be last entry
#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"

// ************************************************************************* //
